validation-seabed-scouring-by-square-jet/testcase-deformationJet2D/deformationJet2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{
    inlet
    {
       type             fixedValue;
       value            uniform 0.00005;
    }
    
    "(wallSop|top|right)"
    {
       type             zeroGradient;
//       inletValue       uniform 1;
//       value            uniform 1;
    }
    
//    "(top)"
//    {
//       type             zeroGradient;
//    }

    "(side1|side2)"
    {
        type            empty;
    }
    
    "(down|left)"
    {
        type            epsilonWallFunction;
//        blending        exponential;
        value           $internalField;
    }


}


// ************************************************************************* //
