validation-seabed-scouring-by-square-jet/testcase-deformationJet2D/deformationJet2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0.0072;

boundaryField
{
    "(right|top|wallSop)"
    {
        type            zeroGradient;//inletOutlet;
//        inletValue      uniform 0.001;
//        value           uniform 0.001;
    }

    inlet
    {
         type           fixedValue;
         value          uniform 0.0072;
    }
    
    "(left|down)"
    {
         type           kqRWallFunction;//zeroGradient;
         value          uniform 0;
    }

    "(side1|side2)"
    {
        type            empty;
    }

}


// ************************************************************************* //
